; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=45, out_folder=htg/blocksworld//training, instance_id=25, seed=2049

(define (problem blocksworld-25)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 - object)
 (:init 
    (arm-empty)
    (clear b36)
    (on b36 b29)
    (on b29 b22)
    (on b22 b33)
    (on b33 b3)
    (on b3 b18)
    (on b18 b31)
    (on b31 b14)
    (on-table b14)
    (clear b5)
    (on-table b5)
    (clear b9)
    (on b9 b16)
    (on b16 b43)
    (on b43 b4)
    (on b4 b30)
    (on b30 b21)
    (on b21 b11)
    (on b11 b32)
    (on b32 b24)
    (on b24 b25)
    (on b25 b26)
    (on b26 b2)
    (on b2 b44)
    (on b44 b19)
    (on b19 b40)
    (on b40 b42)
    (on b42 b10)
    (on b10 b35)
    (on b35 b15)
    (on b15 b6)
    (on b6 b20)
    (on b20 b13)
    (on b13 b12)
    (on b12 b41)
    (on b41 b45)
    (on b45 b23)
    (on b23 b39)
    (on b39 b8)
    (on b8 b1)
    (on b1 b28)
    (on b28 b37)
    (on b37 b27)
    (on b27 b38)
    (on b38 b7)
    (on-table b7)
    (clear b17)
    (on-table b17)
    (clear b34)
    (on-table b34))
 (:goal  (and 
    (clear b4)
    (on b4 b1)
    (on b1 b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b9 b16)
   deleted: (on b9 b16) (clear b9) (arm-empty)
   added: (holding b9) (clear b16)
   goals met: 0 of 5
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 5
3. (unstack b16 b43)
   deleted: (on b16 b43) (clear b16) (arm-empty)
   added: (holding b16) (clear b43)
   goals met: 0 of 5
4. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 5
5. (unstack b43 b4)
   deleted: (on b43 b4) (clear b43) (arm-empty)
   added: (holding b43) (clear b4)
   goals met: 1 of 5
6. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 1 of 5
7. (unstack b4 b30)
   deleted: (on b4 b30) (clear b4) (arm-empty)
   added: (holding b4) (clear b30)
   goals met: 0 of 5
8. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 5
9. (unstack b30 b21)
   deleted: (on b30 b21) (clear b30) (arm-empty)
   added: (holding b30) (clear b21)
   goals met: 1 of 5
10. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 1 of 5
11. (unstack b21 b11)
   deleted: (on b21 b11) (clear b21) (arm-empty)
   added: (holding b21) (clear b11)
   goals met: 1 of 5
12. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 5
13. (unstack b11 b32)
   deleted: (on b11 b32) (clear b11) (arm-empty)
   added: (holding b11) (clear b32)
   goals met: 1 of 5
14. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 5
15. (unstack b32 b24)
   deleted: (on b32 b24) (clear b32) (arm-empty)
   added: (holding b32) (clear b24)
   goals met: 1 of 5
16. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 1 of 5
17. (unstack b24 b25)
   deleted: (on b24 b25) (clear b24) (arm-empty)
   added: (holding b24) (clear b25)
   goals met: 1 of 5
18. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 5
19. (unstack b25 b26)
   deleted: (on b25 b26) (clear b25) (arm-empty)
   added: (holding b25) (clear b26)
   goals met: 1 of 5
20. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 5
21. (unstack b26 b2)
   deleted: (on b26 b2) (clear b26) (arm-empty)
   added: (holding b26) (clear b2)
   goals met: 1 of 5
22. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 5
23. (unstack b2 b44)
   deleted: (on b2 b44) (clear b2) (arm-empty)
   added: (holding b2) (clear b44)
   goals met: 1 of 5
24. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 5
25. (unstack b36 b29)
   deleted: (on b36 b29) (clear b36) (arm-empty)
   added: (holding b36) (clear b29)
   goals met: 2 of 5
26. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 2 of 5
27. (unstack b29 b22)
   deleted: (on b29 b22) (clear b29) (arm-empty)
   added: (holding b29) (clear b22)
   goals met: 2 of 5
28. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 5
29. (unstack b22 b33)
   deleted: (on b22 b33) (clear b22) (arm-empty)
   added: (holding b22) (clear b33)
   goals met: 2 of 5
30. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 5
31. (unstack b33 b3)
   deleted: (on b33 b3) (clear b33) (arm-empty)
   added: (holding b33) (clear b3)
   goals met: 2 of 5
32. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 2 of 5
33. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 2 of 5
34. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 3 of 5
35. (unstack b44 b19)
   deleted: (on b44 b19) (clear b44) (arm-empty)
   added: (holding b44) (clear b19)
   goals met: 3 of 5
36. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 3 of 5
37. (unstack b19 b40)
   deleted: (on b19 b40) (clear b19) (arm-empty)
   added: (holding b19) (clear b40)
   goals met: 3 of 5
38. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 5
39. (unstack b40 b42)
   deleted: (on b40 b42) (clear b40) (arm-empty)
   added: (holding b40) (clear b42)
   goals met: 3 of 5
40. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 5
41. (unstack b42 b10)
   deleted: (on b42 b10) (clear b42) (arm-empty)
   added: (holding b42) (clear b10)
   goals met: 3 of 5
42. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 3 of 5
43. (unstack b10 b35)
   deleted: (on b10 b35) (clear b10) (arm-empty)
   added: (holding b10) (clear b35)
   goals met: 3 of 5
44. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 5
45. (unstack b35 b15)
   deleted: (on b35 b15) (clear b35) (arm-empty)
   added: (holding b35) (clear b15)
   goals met: 3 of 5
46. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 3 of 5
47. (unstack b15 b6)
   deleted: (on b15 b6) (clear b15) (arm-empty)
   added: (holding b15) (clear b6)
   goals met: 3 of 5
48. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 5
49. (unstack b6 b20)
   deleted: (on b6 b20) (clear b6) (arm-empty)
   added: (holding b6) (clear b20)
   goals met: 3 of 5
50. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 3 of 5
51. (unstack b20 b13)
   deleted: (on b20 b13) (clear b20) (arm-empty)
   added: (holding b20) (clear b13)
   goals met: 3 of 5
52. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 3 of 5
53. (unstack b13 b12)
   deleted: (on b13 b12) (clear b13) (arm-empty)
   added: (holding b13) (clear b12)
   goals met: 3 of 5
54. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 5
55. (unstack b12 b41)
   deleted: (on b12 b41) (clear b12) (arm-empty)
   added: (holding b12) (clear b41)
   goals met: 3 of 5
56. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 3 of 5
57. (unstack b41 b45)
   deleted: (on b41 b45) (clear b41) (arm-empty)
   added: (holding b41) (clear b45)
   goals met: 3 of 5
58. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 3 of 5
59. (unstack b45 b23)
   deleted: (on b45 b23) (clear b45) (arm-empty)
   added: (holding b45) (clear b23)
   goals met: 3 of 5
60. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 3 of 5
61. (unstack b23 b39)
   deleted: (on b23 b39) (clear b23) (arm-empty)
   added: (holding b23) (clear b39)
   goals met: 3 of 5
62. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 3 of 5
63. (unstack b39 b8)
   deleted: (on b39 b8) (clear b39) (arm-empty)
   added: (holding b39) (clear b8)
   goals met: 3 of 5
64. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 3 of 5
65. (unstack b8 b1)
   deleted: (on b8 b1) (clear b8) (arm-empty)
   added: (holding b8) (clear b1)
   goals met: 3 of 5
66. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 3 of 5
67. (unstack b1 b28)
   deleted: (on b1 b28) (clear b1) (arm-empty)
   added: (holding b1) (clear b28)
   goals met: 3 of 5
68. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 4 of 5
69. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 5
70. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 5 of 5
